# Пользователь вводит произвольную строку. Выведите кортеж из уникальных символов введённой строки.
line = input ('Введите произвольную строку: ')
result = set(line)
print(result)