# Вывести на экран числа кратные 5 от 0 до 100 включительно.
# Сделать это с помощью функции range с шагом 5
num = 0
for num in range(5, 101, 5):
    print(num)
